import { Nomothesia } from '../../../../nomothesia/types';

export const getProsthikiDetails = (
  dikasimos: string
): {
  nomothesia: string[];
  ypologismos: string[];
  imeres: string[];
  formattedNomothesia: Nomothesia[];
} => {
  const nomothesiaText = `ΚΠολΔ 591 παρ. 1 περ. στ΄ Οι διάδικοι μπορούν έως τη δωδέκατη ώρα της πέμπτης εργάσιμης ημέρας από τη συζήτηση να καταθέσουν προσθήκη στις προτάσεις τους, με την οποία αξιολογούνται οι αποδείξεις, προτείνονται ισχυρισμοί και προσκομίζονται ένορκες βεβαιώσεις, έγγραφα και γνωμοδοτήσεις κατά το άρθρο 390 μόνο για την αντίκρουση ισχυρισμών που προτάθηκαν.`;

  const formattedNomothesia: Nomothesia[] = [
    {
      article: 'ΚΠολΔ 591 παρ. 1 περ. στ΄', 
      text: 'Οι διάδικοι μπορούν έως τη δωδέκατη ώρα της πέμπτης εργάσιμης ημέρας από τη συζήτηση να καταθέσουν προσθήκη στις προτάσεις τους, με την οποία αξιολογούνται οι αποδείξεις, προτείνονται ισχυρισμοί και προσκομίζονται ένορκες βεβαιώσεις, έγγραφα και γνωμοδοτήσεις κατά το άρθρο 390 μόνο για την αντίκρουση ισχυρισμών που προτάθηκαν.',
      highlighted: [
        'Οι διάδικοι μπορούν έως τη δωδέκατη ώρα της πέμπτης εργάσιμης ημέρας από τη συζήτηση να καταθέσουν προσθήκη στις προτάσεις τους',        
      ],
    },
  ];

  return {
    nomothesia: [nomothesiaText],
    ypologismos: [`5 εργάσιμες ημέρες μετά την συζήτηση (${dikasimos})`],
    imeres: ['5 εργάσιμες ημέρες από την συζήτηση.'],
    formattedNomothesia,
  };
};
