import { DeadlineType } from "../types";
import { Nomothesia, NomothesiaCore } from "./types";



export function nomothesiaNeaTaktiki(deadlineType: DeadlineType, exoterikou: boolean): Nomothesia[] {
    if (deadlineType === DeadlineType.EPIDOSI) {
        return nomothesiaNeaTaktikiEpidosi(exoterikou);
    } else if (deadlineType === DeadlineType.PAREMVASI) {
        return nomothesiaNeaTaktikiParemvasi(exoterikou);
    }
    return []
}

// ΕΠΙΔΟΣΗ
// Αρθ. 215 § 2 ΚΠολΔ

var nomothesia215_2: NomothesiaCore = {
    article: "Αρθ. 215 § 2 ΚΠολΔ",
    text: `Στην περίπτωση του άρθρου 237, η αγωγή επιδίδεται στον εναγόμενο μέσα σε προθεσμία τριάντα (30) ημερών από την κατάθεσή της και αν αυτός ή κάποιος από τους ομοδίκους διαμένει στο εξωτερικό ή είναι άγνωστης διαμονής μέσα σε προθεσμία εξήντα (60) ημερών. Αν η αγωγή δεν επιδοθεί μέσα στην προθεσμία αυτή, θεωρείται ως μη ασκηθείσα. (όπως τροποποιήθηκε με το άρθρο δεύτερο του άρθρου 1 του Ν.4335/2015, ΦΕΚ Α 87. Έναρξη ισχύος από 1.1.2016).`
}

function nomothesiaNeaTaktikiEpidosi(exoterikou: boolean): Nomothesia[] {
    let highlighted: string[] = [];
    if (exoterikou) {
        highlighted = [
            "η αγωγή επιδίδεται στον εναγόμενο μέσα σε προθεσμία από την κατάθεσή της και αν αυτός ή κάποιος από τους ομοδίκους διαμένει στο εξωτερικό ή είναι άγνωστης διαμονής μέσα σε προθεσμία εξήντα (60) ημερών",
            "από την κατάθεσή της και αν αυτός ή κάποιος από τους ομοδίκους διαμένει στο εξωτερικό ή είναι άγνωστης διαμονής μέσα σε προθεσμία εξήντα (60) ημερών",
        ];
    } else {
        highlighted = [
            "η αγωγή επιδίδεται στον εναγόμενο μέσα σε προθεσμία τριάντα (30) ημερών από την κατάθεσή της",
        ];
    }
    return [
        {
            ...nomothesia215_2,
            highlighted: highlighted
        }
    ];
}

// ΠΑΡΕΜΒΑΣΗ
// 

var nomothesia238_1: NomothesiaCore = {
    article: "Αρθ. 238 § 1 ΚΠολΔ",
    text: `Παρεμπίπτουσες αγωγές, ανταγωγές, παρεμβάσεις,προσεπικλήσεις και ανακοινώσεις στην περίπτωση του άρθρου 237 κατατίθενται και επιδίδονται σε όλους τους διαδίκους μέσα σε προθεσμία εξήντα (60) ημερών από την κατάθεση της αγωγής. Παρεμβάσεις μετά από προσεπίκληση ή ανακοίνωση κατατίθενται και επιδίδονται σε όλους τους διαδίκους μέσα σε προθεσμία ενενήντα (90) ημερών από την κατάθεση της αγωγής. Αν ο αρχικός εναγόμενος ή κάποιος από τους ομοδίκους του διαμένει στο εξωτερικό ή είναι άγνωστης διαμονής, οι ως άνω προθεσμίες παρατείνονται σε ενενήντα (90) και εκατόν είκοσι (120) ημέρες, αντίστοιχα, από την κατάθεση της αγωγής. Η κατάθεση των προτάσεων γίνεται σε προθεσμία εκατόν είκοσι (120) ημερών και στην περίπτωση του προηγούμενου εδαφίου σε προθεσμία εκατόν ογδόντα (180) ημερών από την κατάθεση της αγωγής. Για την προσθήκη ισχύει η παρ. 2 του άρθρου 237 ΚΠολΔ.`
}

var nomothesia237_2: NomothesiaCore = {
    article: "Αρθ. 237 § 2 ΚΠολΔ",  
    text: "Οι αμοιβαίες αντικρούσεις γίνονται με προσθήκη στις προτάσεις, η οποία κατατίθεται μέσα στις επόμενες δεκαπέντε (15) ημέρες από τη λήξη της παραπάνω προθεσμίας. Νέοι ισχυρισμοί με την προσθήκη μπορεί να προταθούν και νέα αποδεικτικά μέσα να προσκομισθούν μόνο για την αντίκρουση ισχυρισμών που περιέχονται στις προτάσεις. Εκπρόθεσμες προτάσεις και προσθήκες δεν λαμβάνονται υπόψη."
}

function nomothesiaNeaTaktikiParemvasi(exoterikou: boolean): Nomothesia[] {
    let highlighted: string[] = [];
    if (exoterikou) {
        highlighted = [
            "Παρεμπίπτουσες αγωγές, ανταγωγές, παρεμβάσεις,προσεπικλήσεις και ανακοινώσεις στην περίπτωση του άρθρου 237 κατατίθενται και επιδίδονται σε όλους τους διαδίκους μέσα σε προθεσμία",
            "από την κατάθεση της αγωγής",
            "Αν ο αρχικός εναγόμενος ή κάποιος από τους ομοδίκους του διαμένει στο εξωτερικό ή είναι άγνωστης διαμονής, οι ως άνω προθεσμίες παρατείνονται σε ενενήντα (90)",
            "ημέρες, αντίστοιχα, από την κατάθεση της αγωγής.",
        ];
    } else {
        highlighted = [
            "Παρεμπίπτουσες αγωγές, ανταγωγές, παρεμβάσεις,προσεπικλήσεις και ανακοινώσεις στην περίπτωση του άρθρου 237 κατατίθενται και επιδίδονται σε όλους τους διαδίκους μέσα σε προθεσμία εξήντα (60) ημερών από την κατάθεση της αγωγής",
        ];
    }
    return [
        {
            ...nomothesia238_1,
            highlighted: highlighted
        },
        {
            ...nomothesia237_2,
            highlighted: []
        }
    ];
}

