export const codes = [
  {
    efeteio: 'Αθηνών',
    protovathmia: [
      {
        protodikeio: '193',
        eirinodikeia: [
          '193',
          '202',
          '233',
          '247',
          '224',
          '236',
          '237',
          '208',
          '216',
          '238',
          '249',
          '217',
          '212',
        ],
      },
    ],
  },
  {
    efeteio: 'Εύβοιας (Χαλκίδα)',
    protovathmia: [
      {
        protodikeio: '144',
        eirinodikeia: ['Θηβών', 'Ερυθρών', 'Θεσπιών', 'Θίσβης'],
      },
      {
        protodikeio: '155',
        eirinodikeia: [
          'Χαλκίδας',
          'Αγίας Άννας',
          'Αυλωναρίου',
          'Ιστιαίας',
          'Καρύστου',
          'Κύμης',
          'Λίμνης',
          'Σκύρου',
          'Ταμινέων',
        ],
      },
    ],
  },
  {
    efeteio: 'Αιγαίου (Σύρος)',
    protovathmia: [
      {
        protodikeio: '314',
        eirinodikeia: [
          'Σύρου',
          'Άνδρου',
          'Ερμούπολης',
          'Κύθνου',
          'Μήλου',
          'Μυκόνου',
          'Πάρου',
          'Σερίφου',
          'Σίφνου',
          'Τήνου',
        ],
      },
      {
        protodikeio: '322',
        eirinodikeia: ['Σάμου', 'Ευδήλου', 'Ικαρίας', 'Καρλοβασίου'],
      },
      {
        protodikeio: '305',
        eirinodikeia: ['Νάξου', 'Αμοργού', 'Θήρας', 'Ίου', 'Τραγαίας'],
      },
    ],
  },
  {
    efeteio: 'Βορείου Αιγαίου (Μυτιλήνη)',
    protovathmia: [
      {
        protodikeio: '319',
        eirinodikeia: [
          'Μυτιλήνης',
          'Ερεσσού',
          'Καλλονής',
          'Παπάδου',
          'Πλωμαρίου',
          'Πολυχνίτου',
        ],
      },
      {
        protodikeio: '324',
        eirinodikeia: ['Χίου', 'Βολισσού'],
      },
    ],
  },
  {
    efeteio: 'Δυτικής Μακεδονίας (Κοζάνη)',
    protovathmia: [
      {
        protodikeio: '68',
        eirinodikeia: [
          'Κοζάνης',
          'Ανασελίτσης',
          'Εορδαίας',
          'Σερβίων',
          'Σιατίστης',
        ],
      },
      {
        protodikeio: '62',
        eirinodikeia: ['Γρεβενών', 'Δεσκάτης', 'Πενταλόφου'],
      },
      {
        protodikeio: '63',
        eirinodikeia: ['Καστοριάς', 'Νεστορίου', 'Κλεισούρας'],
      },
      {
        protodikeio: '72',
        eirinodikeia: ['Φλώρινας', 'Αμυνταίου', 'Πρεσπών'],
      },
    ],
  },
  {
    efeteio: 'Δωδεκανήσου (Ρόδος)',
    protovathmia: [
      {
        protodikeio: '309',
        eirinodikeia: ['Ρόδου', 'Καρπάθου', 'Σύμης', 'Μεγίστης'],
      },
      {
        protodikeio: '297',
        eirinodikeia: [
          'Κω',
          'Καλύμνου',
          'Λέρου',
          'Πάτμου',
          'Αστυπάλαιας',
          'Νισύρου',
        ],
      },
    ],
  },
  {
    efeteio: 'Θεσσαλονίκης',
    protovathmia: [
      {
        protodikeio: '31',
        eirinodikeia: [
          'Θεσσαλονίκης',
          'Βασιλικών',
          'Κουφαλίων',
          'Λαγκαδά',
          'Σωχού',
        ],
      },
      {
        protodikeio: '24',
        eirinodikeia: ['Βέροιας', 'Αλεξάνδρειας', 'Νάουσας'],
      },
      {
        protodikeio: '43',
        eirinodikeia: ['Έδεσσας', 'Αλμωπίας', 'Σκύδρας'],
      },
      {
        protodikeio: '47',
        eirinodikeia: ['Πιερίας', 'Κολινδρού'],
      },
      {
        protodikeio: '40',
        eirinodikeia: ['Κιλκίς', 'Γουμένισσας', 'Μουριών', 'Πολυκάστρου'],
      },
      {
        protodikeio: '54',
        eirinodikeia: [
          'Σερρών',
          'Ηράκλειας',
          'Νιγρίτας',
          'Πορροΐων',
          'Ροδολίβους',
          'Συντίκης',
          'Φυλλίδος',
        ],
      },
      {
        protodikeio: '59',
        eirinodikeia: [
          'Πολυγύρου',
          'Αρναίας',
          'Ιερισσού',
          'Κασσάνδρας',
          'Ν.Μουδανιών',
          'Συκιάς',
        ],
      },
      {
        protodikeio: '43',
        eirinodikeia: ['Γιαννιτσών', 'Κρύας Βρύσης'],
      },
    ],
  },
  {
    efeteio: 'Θράκης (Κομοτηνή)',
    protovathmia: [
      { protodikeio: '21', eirinodikeia: ['Κομοτηνής', 'Σαππών'] },
      {
        protodikeio: '2',
        eirinodikeia: ['Δράμας', 'Νευροκοπίου', 'Νέστου', 'Προσωτσάνης'],
      },
      {
        protodikeio: '6',
        eirinodikeia: ['Αλεξανδρούπολης', 'Σαμοθράκης', 'Σουφλίου'],
      },
      {
        protodikeio: '11',
        eirinodikeia: ['Καβάλας', 'Θάσου', 'Παγγαίου', 'Χρυσούπολη'],
      },
      {
        protodikeio: '17',
        eirinodikeia: ['Ξάνθης', 'Σταυρούπολης'],
      },
      {
        protodikeio: '8',
        eirinodikeia: ['Ορεστιάδας', 'Διδυμοτείχου', 'Δικαίων'],
      },
    ],
  },
  {
    efeteio: 'Ιωαννίνων',
    protovathmia: [
      {
        protodikeio: '109',
        eirinodikeia: [
          'Ιωαννίνων',
          'Ζαγορίου',
          'Ζίτσης',
          'Κονίτσης',
          'Μετσόβου',
          'Πωγωνίου',
        ],
      },
      {
        protodikeio: '98',
        eirinodikeia: [
          'Άρτας',
          'Καλεντίνης',
          'Τζουμέρκων',
          'Φιλιππιάδας',
          'Δροσοπηγής',
        ],
      },
      {
        protodikeio: '115',
        eirinodikeia: ['Πρέβεζας', 'Θεσπρωτικού', 'Πάργας'],
      },
    ],
  },
  {
    efeteio: 'Κέρκυρας',
    protovathmia: [
      {
        protodikeio: '117',
        eirinodikeia: ['Κέρκυρας', 'Λευκίμης', 'Παξών'],
      },
      {
        protodikeio: '102',
        eirinodikeia: ['Ηγουμενίτσας', 'Παραμυθιάς', 'Φιλιατών'],
      },
    ],
  },
  {
    efeteio: 'Κρήτης (Χανιά)',
    protovathmia: [
      {
        protodikeio: '282',
        eirinodikeia: [
          'Χανίων',
          'Βάμου',
          'Καντάνου',
          'Καστελίου-Κισσάμου',
          'Κολυμβαρίου',
          'Χώρας Σφακίων',
        ],
      },
      {
        protodikeio: '275',
        eirinodikeia: ['Ρεθύμνης', 'Αμαρίου', 'Μυλοποτάμου', 'Σπηλίου'],
      },
    ],
  },
  {
    efeteio: 'Ανατολικής Κρήτης (Ηράκλειο)',
    protovathmia: [
      {
        protodikeio: '262',
        eirinodikeia: [
          'Ηρακλείου',
          'Αρκαλοχωρίου',
          'Βιάννου',
          'Καστελίου-Πεδιάδος',
          'Μοιρών',
          'Πύργου Κρήτης',
          'Χερσονήσσου',
        ],
      },
      {
        protodikeio: '267',
        eirinodikeia: [
          'Αγίου Νικολάου',
          'Νεαπόλεως',
          'Ιεράπετρας',
          'Σητείας',
          'Τζερμιάδων',
        ],
      },
    ],
  },
  {
    efeteio: 'Λαμίας',
    protovathmia: [
      {
        protodikeio: '161',
        eirinodikeia: [
          'Λαμίας',
          'Αταλάντης',
          'Αμφίκλειας',
          'Δομοκού',
          'Ελάτειας',
          'Θερμοπυλών',
          'Μακρακώμης',
          'Σπερχειάδας',
          'Υπάτης',
          'Φαλάρων',
        ],
      },
      {
        protodikeio: '165',
        eirinodikeia: [
          'Άμφισσας',
          'Δελφών',
          'Δωρίδος',
          'Δωριέων',
          'Ευπαλίου',
          'Ιτέας',
          'Τολοφώνος',
        ],
      },
      {
        protodikeio: '157',
        eirinodikeia: ['Ευρυτανίας', 'Αγραίων', 'Απεραντίων'],
      },
      {
        protodikeio: '145',
        eirinodikeia: [
          'Λιβαδειάς',
          'Αλιάρτου',
          'Αμβρυσσού',
          'Αράχωβας',
          'Δαυλείας',
          'Ορχομενού',
        ],
      },
    ],
  },
  {
    efeteio: 'Λάρισας',
    protovathmia: [
      {
        protodikeio: '82',
        eirinodikeia: [
          'Λάρισας',
          'Ελασσόνας',
          'Αγυιάς',
          'Κισσάβου',
          'Ολύμπου',
          'Τυρνάβου',
          'Φαρσάλων',
        ],
      },
      {
        protodikeio: '87',
        eirinodikeia: [
          'Βόλου',
          'Αλμυρού',
          'Αργαλαστής',
          'Ζαγοράς',
          'Μηλέων',
          'Σκιάθου',
          'Σκοπέλου',
          'Φερών',
        ],
      },
      {
        protodikeio: '74',
        eirinodikeia: ['Καρδίτσας', 'Μουζακίου', 'Παλαμά', 'Σοφάδων'],
      },
      {
        protodikeio: '96',
        eirinodikeia: ['Τρικάλων', 'Καλαμπάκας', 'Πύρρας', 'Φαρκαδόνος'],
      },
    ],
  },
  {
    efeteio: 'Ναυπλίου',
    protovathmia: [
      {
        protodikeio: '170',
        eirinodikeia: [
          'Ναυπλίου',
          'Άργους',
          'Άστρους',
          'Μάσσητος',
          'Ν.Επιδαύρου',
          'Πρασσιών',
        ],
      },
      {
        protodikeio: '178',
        eirinodikeia: [
          'Κορίνθου',
          'Σικυώνος',
          'Δερβενίου',
          'Νεμέας',
          'Ξυλοκάστρου',
          'Στυμφαλίας',
          'Φενεού',
        ],
      },
      {
        protodikeio: '186',
        eirinodikeia: ['Σπάρτης', 'Επιδαύρου-Λιμηράς', 'Καστορίου', 'Κροκεών'],
      },
      {
        protodikeio: '175',
        eirinodikeia: [
          'Τρίπολης',
          'Καρυταίνης',
          'Μεγαλόπολης',
          'Νυμφασίας',
          'Ορχομενού',
          'Τανίας Δολανών',
          'Τευθίδος',
          'Τροπαίων',
          'Ψωφίδος',
        ],
      },
    ],
  },
  {
    efeteio: 'Πατρών',
    protovathmia: [
      {
        protodikeio: '134',
        eirinodikeia: ['Πατρών', 'Δύμης', 'Τριταίας', 'Φαρρών'],
      },
      {
        protodikeio: '130',
        eirinodikeia: ['Αιγιαλείας', 'Ερινεού'],
      },
      {
        protodikeio: '141',
        eirinodikeia: [
          'Αμαλιάδας',
          'Βάρδας',
          'Βαρθολομιού',
          'Γαστούνης',
          'Μυρτουντίων',
        ],
      },
      {
        protodikeio: '116',
        eirinodikeia: ['Ζακύνθου'],
      },
      {
        protodikeio: '141',
        eirinodikeia: [
          'Πύργου',
          'Ελευσίνας Πελοποννήσου',
          'Κρεστένων',
          'Λαμπείας',
          'Ολυμπίων',
          'Ωλένης',
          'Ανδρίτσαινης',
          'Αρήνης',
        ],
      },
      {
        protodikeio: '133',
        eirinodikeia: ['Καλαβρύτων', 'Ακράτας', 'Αροανίας', 'Κλειτορίας'],
      },
      {
        protodikeio: '119',
        eirinodikeia: ['Αργοστολίου', 'Ιθάκης', 'Ληξουρίου', 'Σαμαίων'],
      },
    ],
  },
  {
    efeteio: 'Δυτικής Στερεάς Ελλάδας (Αγρίνιο)',
    protovathmia: [
      {
        protodikeio: '124',
        eirinodikeia: ['Αγρινίου', 'Βάλτου', 'Εχίνου', 'Θέρμου'],
      },
      {
        protodikeio: '121',
        eirinodikeia: ['Λευκάδας', 'Απολλωνίων', 'Βονίτσας', 'Σολίου'],
      },
      {
        protodikeio: '128',
        eirinodikeia: [
          'Μεσολογίου',
          'Αιτωλικού',
          'Αποδοτίας',
          'Μακρυνείας',
          'Ναυπάκτου',
          'Ξηρομέρου',
          'Παραχελωΐτιδος',
          'Προσχίου',
        ],
      },
    ],
  },
  {
    efeteio: 'Πειραιά',
    protovathmia: [
      {
        protodikeio: '231',
        eirinodikeia: [
          'Πειραιά',
          'Αιγίνης',
          'Καλαυρίας',
          'Κυθήρων',
          'Νίκαιας',
          'Σαλαμίνας',
          'Σπετσών',
        ],
      },
    ],
  },
  {
    efeteio: 'Καλαμάτας',
    protovathmia: [
      {
        protodikeio: '188',
        eirinodikeia: ['Καλαμάτας', 'Οιχαλίας', 'Παμίσου', 'Πύλου'],
      },
      {
        protodikeio: '192',
        eirinodikeia: [
          'Κυπαρισσίας',
          'Δωρίου',
          'Εράνης',
          'Πλαταμώδους',
          'Φλεσιάδος',
          'Φυγαλείας',
        ],
      },
      {
        protodikeio: '186',
        eirinodikeia: [
          'Γυθείου',
          'Νεαπόλεως Βοιών',
          'Εράνης',
          'Πλαταμώδους',
          'Φλεσιάδος',
          'Φυγαλείας',
        ],
      },
    ],
  },
];
